app/controllers/bundles_controller.rb

  def index
    if !params[:bundle_id].nil?
      @bundles = Bundle.find("id=?",params[:bundle_id])
    else
      @bundles = Bundle.all
---
SELECT * FROM "bundles"

  def show
    @bundle = Bundle.find(params[:id])
---
SELECT * FROM "bundles" WHERE ("bundles"."id" = 1)

  def search_for_best_bundle
    @bundles = Bundle.all
    @bundles.delete_if { |bundle|
      risk = 0
      sub1 = 0
      sub2 = 0
      profit = 0
      mark = false
      termTooLongFlag = false
      bundle.loans.each { |loan|
---
SELECT * FROM "bundles"
SELECT * FROM "loans" WHERE ("loans".bundle_id = 1)

  def edit
    @bundle = Bundle.find(params[:id])
---
SELECT * FROM "bundles" WHERE ("bundles"."id" = 1)

  def create
    @bundle = Bundle.new(params[:bundle])

    respond_to do |format|
      if @bundle.save
---
INSERT INTO "bundles" ("name", "created_at", "updated_at") VALUES('Globe Trotter High Yield Bundle', '2010-04-26 18:30:05', '2010-04-26 18:30:05')