app/controllers/lenders_controller.rb

  def index
    @lenders = Lender.all
---
SELECT * FROM "lenders"

  def show
    @lender = Lender.find(params[:id])
---
SELECT * FROM "lenders" WHERE ("lenders"."id" = 1)

  def edit
    @lender = Lender.find(params[:id])
---
SELECT * FROM "lenders" WHERE ("lenders"."id" = 3)

  def create
    @lender = Lender.new(params[:lender])

    respond_to do |format|
      if @lender.save
---
INSERT INTO "lenders" ("name", "description", "created_at", "updated_at") VALUES('First Federal Capital', 'That bank that does that stuff that one time.', '2010-04-26 17:49:55', '2010-04-26 17:49:55')