app/controllers/loans_controller.rb

  def index
    start = 20
    size = 10
    sort = "id ASC"
    start = params[:start].to_i+1 if !params[:start].blank?
    size = params[:size].to_i if !params[:size].blank?
    page = ((start/size).to_i) if start != 1
    sort = "#{params[:sort]} #{params[:dir]}" if !params[:sort].blank?
    #@loans = Loan.paginate(:all,
    #  :page => page,
    #  :per_page => size,
    #  :order => sort)

    if !params[:bundle_id].nil?
      # Todo: Research using Rails magic to do @loans = Bundle.find().loans instead with will_paginate
      @loans = Loan.paginate(:all, :page => page, :order => sort, :conditions => ["bundle_id=?",params[:bundle_id]])
---
SELECT * FROM "loans" WHERE (bundle_id='2') ORDER BY id ASC LIMIT 20 OFFSET 20
SELECT count(*) AS count_all FROM "loans" WHERE (bundle_id='2')

  def toggle_lock
    puts "RECEIVED AJAX CALL ID IS: #{params[:id]}"
    @loan = Loan.find(params[:id])
    @loan.toggle!(:locked)
---
SELECT * FROM "loans" WHERE ("loans"."id" = 1)
UPDATE "loans" SET "locked" = 't', "updated_at" = '2010-05-22 16:52:41' WHERE "id" = 1

  def show
    @loan = Loan.find(params[:id])
---
SELECT * FROM "loans" WHERE ("loans"."id" = 1)

  def edit
    @loan = Loan.find(params[:id])
---
SELECT * FROM "loans" WHERE ("loans"."id" = 1)

  def create
    @loan = Loan.new(params[:loan])

    respond_to do |format|
      if @loan.save
---
INSERT INTO "loans" ("lender_id", "borrower_id", "status", "type", "amount", "interest_rate", "settlement_date", "locked", "created_at", "updated_at") VALUES(1, 1, 'good', NULL, 125000.0, 4.5, '2009-03-08 17:40:00', 'f', '2010-04-26 17:48:02', '2010-04-26 17:48:02')