app/controllers/loans_controller.rb

SELECT * FROM "loans" WHERE (risk > 75)
---
  def autobundle
    @loans = Loan.all(:conditions => ["risk > ?",params[:max_risk]])